# Problem Statement

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

import warnings as war
war.filterwarnings('ignore')

In [3]:
df = pd.read_csv('https://d2beiqkhq929f0.cloudfront.net/public_assets/assets/000/002/492/original/ola_driver_scaler.csv')
df.head()

,Unnamed: 0,MMM-YY,Driver_ID,Age,Gender,City,Education_Level,Income,Dateofjoining,LastWorkingDate,Joining Designation,Grade,Total Business Value,Quarterly Rating
0,0,01/01/19,1,28.0,0.0,C23,2,57387,24/12/18,NaN,1,1,2381060,2
1,1,02/01/19,1,28.0,0.0,C23,2,57387,24/12/18,NaN,1,1,-665480,2
2,2,03/01/19,1,28.0,0.0,C23,2,57387,24/12/18,03/11/19,1,1,0,2
3,3,11/01/20,2,31.0,0.0,C7,2,67016,11/06/20,NaN,2,2,0,1
4,4,12/01/20,2,31.0,0.0,C7,2,67016,11/06/20,NaN,2,2,0,1

# Data Profiling

- MMMM-YY : Reporting Date (Monthly)
- Driver_ID : Unique id for drivers
- Age : Age of the driver
- Gender : Gender of the driver – Male : 0, Female: 1
- City : City Code of the driver
- Education_Level : Education level – 0 for 10+ ,1 for 12+ ,2 for graduate
- Income : Monthly average Income of the driver
- Date Of Joining : Joining date for the driver
- LastWorkingDate : Last date of working for the driver
- Joining Designation : Designation of the driver at the time of joining
- Grade : Grade of the driver at the time of reporting
- Total Business Value : The total business value acquired by the driver in a month (negative business indicates cancellation/refund or car EMI adjustments)
- Quarterly Rating : Quarterly rating of the driver: 1,2,3,4,5 (higher is better)

In [5]:
df.head()

,Unnamed: 0,MMM-YY,Driver_ID,Age,Gender,City,Education_Level,Income,Dateofjoining,LastWorkingDate,Joining Designation,Grade,Total Business Value,Quarterly Rating
0,0,01/01/19,1,28.0,0.0,C23,2,57387,24/12/18,NaN,1,1,2381060,2
1,1,02/01/19,1,28.0,0.0,C23,2,57387,24/12/18,NaN,1,1,-665480,2
2,2,03/01/19,1,28.0,0.0,C23,2,57387,24/12/18,03/11/19,1,1,0,2
3,3,11/01/20,2,31.0,0.0,C7,2,67016,11/06/20,NaN,2,2,0,1
4,4,12/01/20,2,31.0,0.0,C7,2,67016,11/06/20,NaN,2,2,0,1

## Exploritory Data Analysis

In [6]:
df.columns

Index(['Unnamed: 0', 'MMM-YY', 'Driver_ID', 'Age', 'Gender', 'City',
       'Education_Level', 'Income', 'Dateofjoining', 'LastWorkingDate',
       'Joining Designation', 'Grade', 'Total Business Value',
       'Quarterly Rating'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19104 entries, 0 to 19103
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            19104 non-null  int64
 1   MMM-YY                19104 non-null  object
 2   Driver_ID             19104 non-null  int64
 3   Age                   19043 non-null  float64
 4   Gender                19052 non-null  float64
 5   City                  19104 non-null  object
 6   Education_Level       19104 non-null  int64
 7   Income                19104 non-null  int64
 8   Dateofjoining         19104 non-null  object
 9   LastWorkingDate       1616 non-null   object
 10  Joining Designation   19104 non-null  int64
 11  Grade                 19104 non-null  int64
 12  Total Business Value  19104 non-null  int64
 13  Quarterly Rating      19104 non-null  int64
dtypes: float64(2), int64(8), object(4)
memory usage: 2.0+ MB

In [8]:
df.isnull().sum()

Unnamed: 0                  0
MMM-YY                      0
Driver_ID                   0
Age                        61
Gender                     52
City                        0
Education_Level             0
Income                      0
Dateofjoining               0
LastWorkingDate         17488
Joining Designation         0
Grade                       0
Total Business Value        0
Quarterly Rating            0
dtype: int64

In [9]:
df.describe()

,Unnamed: 0,Driver_ID,Age,Gender,Education_Level,Income,Joining Designation,Grade,Total Business Value,Quarterly Rating
count,19104.000000,19104.000000,19043.000000,19052.000000,19104.000000,19104.000000,19104.000000,19104.000000,1.910400e+04,19104.000000
mean,9551.500000,1415.591133,34.668435,0.418749,1.021671,65652.025126,1.690536,2.252670,5.716621e+05,2.008899
std,5514.994107,810.705321,6.257912,0.493367,0.800167,30914.515344,0.836984,1.026512,1.128312e+06,1.009832
min,0.000000,1.000000,21.000000,0.000000,0.000000,10747.000000,1.000000,1.000000,-6.000000e+06,1.000000
25%,4775.750000,710.000000,30.000000,0.000000,0.000000,42383.000000,1.000000,1.000000,0.000000e+00,1.000000
50%,9551.500000,1417.000000,34.000000,0.000000,1.000000,60087.000000,1.000000,2.000000,2.500000e+05,2.000000
75%,14327.250000,2137.000000,39.000000,1.000000,2.000000,83969.000000,2.000000,3.000000,6.997000e+05,3.000000
max,19103.000000,2788.000000,58.000000,1.000000,2.000000,188418.000000,5.000000,5.000000,3.374772e+07,4.000000

In [16]:
print(f'The number of rows in dataframe: {df.shape[0]}')
print(f"Unique number of Driver ID: {df['Driver_ID'].nunique()}")

The number of rows in dataframe: 19104
Unique number of Driver ID: 2381

In [18]:
# It shows there could be duplicate records for each driver ID. Lets do a doublec check on this.

In [31]:
df_driver_summary = df.groupby(by=['Driver_ID'])['Income'].count().reset_index().rename(columns={'Income':'Count'})
df_driver_summary[df_driver_summary['Count'] > 1].sort_values(by=['Count'], ascending=False)

# Driver ID 569 has 24 records. Lets investigate further

      Driver_ID  Count
489         569     24
230         275     24
887        1043     24
2289       2684     24
788         926     24
...         ...    ...
1381       1624      2
1382       1625      2
1383       1626      2
354         419      2
901        1062      2

[2200 rows x 2 columns]

In [34]:
df[df['Driver_ID'] == 569]

,Unnamed: 0,MMM-YY,Driver_ID,Age,Gender,City,Education_Level,Income,Dateofjoining,LastWorkingDate,Joining Designation,Grade,Total Business Value,Quarterly Rating
3873,3873,01/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,200000,3
3874,3874,02/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1617630,3
3875,3875,03/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,2885720,3
3876,3876,04/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,155320,2
3877,3877,05/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,291010,2
3878,3878,06/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,147900,2
3879,3879,07/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,850000,4
3880,3880,08/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,912000,4
3881,3881,09/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1765000,4
3882,3882,10/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,172000,3
3883,3883,11/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,715600,3
3884,3884,12/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1035520,3
3885,3885,01/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,700000,4
3886,3886,02/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,2253990,4
3887,3887,03/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,5669390,4
3888,3888,04/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,2291430,4
3889,3889,05/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,0,4
3890,3890,06/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,0,4
3891,3891,07/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,2896080,4
3892,3892,08/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1000680,4
3893,3893,09/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1401000,4
3894,3894,10/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,536580,3
3895,3895,11/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1036230,3
3896,3896,12/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,997300,3

In [36]:
# Dropping the Unnamed column as it doesn't add any value here
df.drop(columns=['Unnamed: 0'],axis=1, inplace = True)

In [38]:
df[df['Driver_ID'] == 569]

# Data is on a monthly level hence, we need to aggregate it and also need to create a target column based on the LastworkingDate column

,MMM-YY,Driver_ID,Age,Gender,City,Education_Level,Income,Dateofjoining,LastWorkingDate,Joining Designation,Grade,Total Business Value,Quarterly Rating
3873,01/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,200000,3
3874,02/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1617630,3
3875,03/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,2885720,3
3876,04/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,155320,2
3877,05/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,291010,2
3878,06/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,147900,2
3879,07/01/19,569,38.0,1.0,C26,0,111743,31/12/15,NaN,2,3,850000,4
3880,08/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,912000,4
3881,09/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1765000,4
3882,10/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,172000,3
3883,11/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,715600,3
3884,12/01/19,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1035520,3
3885,01/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,700000,4
3886,02/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,2253990,4
3887,03/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,5669390,4
3888,04/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,2291430,4
3889,05/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,0,4
3890,06/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,0,4
3891,07/01/20,569,39.0,1.0,C26,0,111743,31/12/15,NaN,2,3,2896080,4
3892,08/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1000680,4
3893,09/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1401000,4
3894,10/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,536580,3
3895,11/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,1036230,3
3896,12/01/20,569,40.0,1.0,C26,0,111743,31/12/15,NaN,2,3,997300,3

In [42]:
df_mod = df.groupby(["Driver_ID"]).aggregate({'MMM-YY':len,"Age":max,"City":np.unique,"Education_Level":max,"Income":np.mean,"Dateofjoining":np.unique,"Joining Designation":np.unique,
                                               "Grade": np.mean,"Total Business Value":sum, "Quarterly Rating":np.mean}).reset_index()

In [45]:
df_mod.head()

,Driver_ID,MMM-YY,Age,City,Education_Level,Income,Dateofjoining,Joining Designation,Grade,Total Business Value,Quarterly Rating
0,1,3,28.0,C23,2,57387.0,24/12/18,1,1.0,1715580,2.0
1,2,2,31.0,C7,2,67016.0,11/06/20,2,2.0,0,1.0
2,4,5,43.0,C13,2,65603.0,12/07/19,2,2.0,350000,1.0
3,5,3,29.0,C9,0,46368.0,01/09/19,1,1.0,120360,1.0
4,6,5,31.0,C11,1,78728.0,31/07/20,3,3.0,1265000,1.6

In [48]:
df_mod.rename(columns = {'MMM-YY':'Length_of_Service','Dateofjoining':'Date_of_Joining','Joining Designation':'Joining_Designation','Total Business Value': 'Total_Business_Value', 'Quarterly Rating': 'Quarterly_Rating'}, inplace= True)

In [51]:
print(f'The number of rows in dataframe: {df_mod.shape[0]}')
print(f"Unique number of Driver ID: {df_mod['Driver_ID'].nunique()}")

The number of rows in dataframe: 2381
Unique number of Driver ID: 2381

In [53]:
#Validation completed. Now lets add the target column for each driver ID

In [67]:
final_df = pd.merge(left = df.groupby(by=['Driver_ID'])['LastWorkingDate'].unique().apply(lambda x: x[-1]), right = df_mod,  on = "Driver_ID", how="outer")

In [68]:
final_df = pd.merge(left = df.groupby(by=['Driver_ID'])['Gender'].unique().apply(lambda x: x[-1]), right = final_df,  on = "Driver_ID", how="outer")

In [69]:
final_df

,Driver_ID,Gender,LastWorkingDate,Length_of_Service,Age,City,Education_Level,Income,Date_of_Joining,Joining_Designation,Grade,Total_Business_Value,Quarterly_Rating
0,1,0.0,03/11/19,3,28.0,C23,2,57387.0,24/12/18,1,1.0,1715580,2.000000
1,2,0.0,NaN,2,31.0,C7,2,67016.0,11/06/20,2,2.0,0,1.000000
2,4,0.0,27/04/20,5,43.0,C13,2,65603.0,12/07/19,2,2.0,350000,1.000000
3,5,0.0,03/07/19,3,29.0,C9,0,46368.0,01/09/19,1,1.0,120360,1.000000
4,6,1.0,NaN,5,31.0,C11,1,78728.0,31/07/20,3,3.0,1265000,1.600000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2376,2784,0.0,NaN,24,34.0,C24,0,82815.0,15/10/15,2,3.0,21748820,2.625000
2377,2785,1.0,28/10/20,3,34.0,C9,0,12105.0,28/08/20,1,1.0,0,1.000000
2378,2786,0.0,22/09/19,9,45.0,C19,0,35370.0,31/07/18,2,2.0,2815090,1.666667
2379,2787,1.0,20/06/19,6,28.0,C20,2,69498.0,21/07/18,1,1.0,977830,1.500000
2380,2788,0.0,NaN,7,30.0,C27,2,70254.0,06/08/20,2,2.0,2298240,2.285714

In [70]:
final_df['Gender'].value_counts()

0.0    1380
1.0     956
Name: Gender, dtype: int64

In [72]:
# Creating the Target Column